[
    {
        "id": 1,
        "title": "Angular JS",
        "time": 22.95,
        "description": "One of the most powerful and efficient JavaScript frameworks, Angular is an open-source framework that is used for developing a Single Page Application (SPA). It extends the HTML into the application and interprets the attributes to perform data binding.",
        "category": "men's clothing",
        "image": "https://acquven.com/blog/02/images/angular.jpg",
        "rating": {
            "rate": 3.9,
            "view": 120
        }
    },
    {
        "id": 2,
        "title": "React JS",
        "time": 109.3,
        "description": "Created by Facebook, the React framework has earned popularity very quickly. It is used to develop and operate the dynamic User Interface of web pages with high incoming traffic. It makes use of a virtual DOM, and hence, integration with any application is more straightforward.",
        "category": "men's clothing",
        "image": "hhttps://codegeekz.com/wp-content/uploads/reactjs.png",
        "rating": {
            "rate": 4.1,
            "view": 259
        }
    },
    {
        "id": 3,
        "title": "Vue JS",
        "time": 55.99,
        "description": "Though developed in the year 2016, this JavaScript framework has already made its way into the market and has proven its worth by offering numerous features. Its dual integration mode is one of the most attractive features for creating a high-end SPA. It is a reliable platform for cross-platform development.",
        "category": "men's clothing",
        "image": "https://positivethinking.tech/wp-content/uploads/2021/01/Logo-Vuejs.png",
        "rating": {
            "rate": 4.7,
            "view": 500
        }
    },
    {
        "id": 4,
        "title": "Meteor JS",
        "time": 15.99,
        "description": "Meteor has several different uses, covering a significant portion of the software development. Uses include back-end development, management of the database, business logic, and rendering of the front-end.",
        "category": "men's clothing",
        "image": "https://v6i7z7i8.rocketcdn.me/wp-content/uploads/2016/04/meteor-1.png",
        "rating": {
            "rate": 2.1,
            "view": 430
        }
    },
    {
        "id": 5,
        "title": "Node JS",
        "time": 695,
        "description": "Node.js is a server-side JavaScript run-time environment, which works on cross platforms and is open-source. The framework is capable of driving asynchronous I/O with its event-driven architecture. It works in the JavaScript Runtime environment and shows JAVA's similar properties like threading, packaging, and forming loops.",
        "category": "jewelery",
        "image": "https://miro.medium.com/max/1400/1*xdo0UBpyszvD7-7EH4TkIA.png",
        "rating": {
            "rate": 4.6,
            "view": 400
        }
    },
    {
        "id": 6,
        "title": "Polymer JS",
        "time": 168,
        "description": "Polymer is an open-source JavaScript library developed by Google, and can create a website's elements without getting too complex. It also supports both one-way and two-way data binding, which gives it a more extensive application area.",
        "category": "jewelery",
        "image": "https://www.atlassoftweb.com/wp-content/uploads/2017/07/Introduction-to-Polymer.jpg",
        "rating": {
            "rate": 3.9,
            "view": 70
        }
    },
    {
        "id": 7,
        "title": "Aurelia JS",
        "time": 79.99,
        "description": "Though not quite as common as it once was, the Aurelia framework is useful for developing far more robust websites. This JS framework can extend the HTML for several purposes, including data binding. Its modern architecture ensures that the purpose of toll is for interpretation client-side and server-side at a time.",
        "category": "jewelery",
        "image": "https://mobilemancerblog.blob.core.windows.net/blog/2016/08/Big-Aurelia-Logo.png",
        "rating": {
            "rate": 3,
            "view": 400
        }
    },
    {
        "id": 8,
        "title": "Backbone JS",
        "time": 10.99,
        "description": "Quite easy to learn, Backbone is used to create Single Page Applications. The development of this framework uses the idea that all the server-side functions must flow through an API, which helps achieve complex functionalities with less code.",
        "category": "jewelery",
        "image": "https://www.etatvasoft.com/insights/wp-content/uploads/2017/02/b-thumb-img8.jpg",
        "rating": {
            "rate": 1.9,
            "view": 100
        }
    }
]